app/views/students/_form.html.erb

  University:
  <% @universities = University.all %>
---
SELECT "universities".* FROM "universities"