app/controllers/books_controller.rb

  def index
    if session[:role] == "student"
      @library = Library.find_by_university_id(session[:university_id])
      @book = Book.where(library_id: @library[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ? LIMIT ?  [["university_id", "11"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."library_id" = ?  [["library_id", "4"]]

  def book_bookmark
    @bookmark = Bookmark.new(:student_id => session[:student_id], :ISBN => params[:ISBN])
    if !Bookmark.find_by_student_id_and_ISBN(session[:student_id],params[:ISBN])
      @bookmark.save
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = ? AND "bookmarks"."ISBN" = ? LIMIT ?  [["student_id", 9], ["ISBN", "1"], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("student_id", "ISBN", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 9], ["ISBN", "1"], ["created_at", "2019-10-02 05:06:11.431351"], ["updated_at", "2019-10-02 05:06:11.431351"]]

 def checkout
    @student = Student.find_by_id(session[:student_id])

    if Transaction.find_by_student_id(session[:student_id])
      @tran = Transaction.find_by_student_id(session[:student_id])
      m = Transaction.where(student_id: @tran[:student_id]).count

      if @student[:maximum_book_limit].to_i > m
        @book = Book.find_by_ISBN(params[:ISBN])

        now = Date.today
        max_day = Library.find_by_library_id(@book[:library_id].to_i)[:max_days]
        after = now + max_day.to_i

        copies = @book[:copies]
        if (copies.to_i > 0)
          ####special request###
            if @book[:specialcollection] == "yes"
              @trn = Transaction.new(:student_id => session[:student_id],:bookname => params[:bookname], :ISBN => params[:ISBN], :status => "approval request", :library_id => @book[:library_id])
              @trn.save
              flash[:notice] = "Request sent to librarian for approval"
              redirect_to :controller => 'students', :action => 'index'
              #####special request###
            else
              @trn = Transaction.new(:student_id => session[:student_id],:bookname => params[:bookname], :ISBN => params[:ISBN], :status => "checked out", :library_id => @book[:library_id], :checkout_date => now, :expected_date => after)
              @trn.save
              @book.update_attribute(:copies, (copies.to_i-1).to_s)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."student_id" = ? LIMIT ?  [["student_id", 9], ["LIMIT", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."student_id" = ?  [["student_id", 9]]
SELECT  "books".* FROM "books" WHERE "books"."ISBN" = ? LIMIT ?  [["ISBN", "5"], ["LIMIT", 1]]
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."library_id" = ? LIMIT ?  [["library_id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("student_id", "ISBN", "bookname", "checkout_date", "expected_date", "status", "created_at", "updated_at", "library_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "books" SET "copies" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["copies", "4"], ["updated_at", "2019-10-02 05:06:43.327611"], ["id", 16]]

def search
  if params[:subject] != ""
        if params[:title] != ""
                if params[:author] != ""
                  @book = Book.where(subject: params[:subject],title: params[:title],author: params[:author])
                else
                  @book = Book.where(subject: params[:subject],title: params[:title])
                end
        elsif params[:author] != ""
                @book = Book.where(subject: params[:subject],author: params[:author])
        else
             @book = Book.where(subject: params[:subject])
        end
  elsif params[:title] != ""
        if params[:author] != ""
                  @book = Book.where(title: params[:title],author: params[:author])
        else
                  @book = Book.where(title: params[:title])
        end
  elsif params[:author] != ""
         @book = Book.where(author: params[:author])
---
SELECT "books".* FROM "books" WHERE "books"."subject" = ? AND "books"."title" = ? AND "books"."author" = ?  [["subject", "COmputer science"], ["title", "Introduction to algorithms"], ["author", "Cormen"]]
SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", ""]]
SELECT "books".* FROM "books" WHERE "books"."author" = ?  [["author", "Armando"]]

  def show
    @book = Book.find_by_ISBN(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."ISBN" = ? LIMIT ?  [["ISBN", "search"], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    uploaded_to = params[:book][:image_url]
    @book[:library_id] = session[:library]
    @book[:specialcollection] = params[:specialcollection]
    puts "cccccccccccccccc$$$$$$$$"
    puts @book[:specialcollection]
    puts "#^^^^^^^^^^^666"
    @book[:image] = "asofnow"

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("ISBN", "title", "author", "language", "published", "edition", "library_id", "image", "subject", "summary", "specialcollection", "created_at", "updated_at", "copies") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)