app/controllers/libraries_controller.rb

  def index
    @library = Library.where(university_id:  session[:university_id])
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ?  [["university_id", "8"]]