app/controllers/librarians_controller.rb

  def new

    @librarian = Librarian.new
    @library = Library.all
---
SELECT "libraries".* FROM "libraries"

  def create

    @library = Library.find_by_library_id(params[:libr])
    params = librarian_params
    params[:library_id] = @library.id
    @librarian = Librarian.new(params)
    @librarian[:is_valid] = "requested"

    student = Student.find_by_email(@librarian[:email])

    if student == nil
      if @librarian.save
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."library_id" = ? LIMIT ?  [["library_id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "s@s.com"], ["LIMIT", 1]]
INSERT INTO "librarians" ("email", "password_digest", "name", "library_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def approval_requests
    if session[:role] != 'librarian'
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
      @holds = Transaction.where(["status = ? and library_id = ?", "approval request", session[:library]])
---
SELECT "transactions".* FROM "transactions" WHERE (status = 'hold request' and library_id = '1')