app/controllers/logins_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "88@88.com"], ["LIMIT", 1]]
SELECT  "librarians".* FROM "librarians" WHERE "librarians"."email" = ? LIMIT ?  [["email", "1@2.com"], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "88@88.com"], ["LIMIT", 1]]
---
  def create

    @login = Login.new(login_params)
    student = Student.find_by_email(@login[:email])
    if student&.authenticate(params[:login][:password])
      session[:student_id] = student.id
      session[:role] = "student"
      session[:university_id] = student.university_id
      redirect_to :controller => 'students', :action => 'index'
    elsif Librarian.find_by_email(@login[:email])
      librarian = Librarian.find_by_email(@login[:email])
      if librarian&.authenticate(params[:login][:password])
        if librarian.is_valid == 'requested'
          flash[:notice] = "Your request is still in queue"
          redirect_to root_path
        else
          session[:librarian_id] = librarian.id
          session[:role] = "librarian"
          session[:library] = librarian[:library_id]
          session[:status] = librarian.is_valid
          redirect_to :controller => 'librarians', :action => 'index'
        end
      else
        flash[:notice] = "Invalid Credentials"
        redirect_to root_path
      end
    elsif Admin.find_by_email(@login[:email])