app/controllers/students_controller.rb

  def show
    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    #if !session[:student_id]
     # flash[:notice] = "login to access Account "
     # redirect_to root_url
    #else
  	@student = Student.new(student_params)
    ####to find if user is already librarian
    librarian = Librarian.find_by_email(@student[:email])
    if librarian == nil
            if params[:student][:educational_level]=="Undergraduate"
            	@student[:maximum_book_limit] = 2
            elsif params[:student][:educational_level]=="graduate"
            	@student[:maximum_book_limit] = 4
            elsif params[:student][:educational_level]=="phd"
            	@student[:maximum_book_limit] = 6
            end
            @student[:university_id] = params[:university_id].to_s
            respond_to do |format|
              if @student.save
---
SELECT  "librarians".* FROM "librarians" WHERE "librarians"."email" = ? LIMIT ?  [["email", "student@student.com"], ["LIMIT", 1]]
INSERT INTO "students" ("email", "name", "password_digest", "educational_level", "university_id", "maximum_book_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

 def update
    if session[:admin_id] != nil
      @student = Student.find(params[:id])

    respond_to do |format|
      #format.html { redirect_to @student, notice: 'Student Info was successfully updated.' }
      #,
      if @student.update_attributes(student_params)
        format.html { redirect_to :controller => 'admins', :action => 'showallstudents', notice: 'Student Info was successfully updated.' }
        format.json { head :no_content }
      else
        format.html { render action: "edit" }
        format.json { render json: @student.errors, status: :unprocessable_entity }
      end
    end
   else

    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def edit
    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
  else
    @student = Student.find(session[:student_id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

  def mybooks
    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
    @tran  = Transaction.where(student_id: session[:student_id], status: "checked out")
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."student_id" = ? AND "transactions"."status" = ?  [["student_id", 9], ["status", "checked out"]]

  def viewbookmark
    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
      @bookmark = Bookmark.where(:student_id => session[:student_id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = ?  [["student_id", 9]]

  def fines
    if !session[:student_id]
      flash[:notice] = "login to access Account "
      redirect_to root_url
    else
      @fines = Transaction.where(Transaction.arel_table[:student_id].eq(session[:student_id]).and(Transaction.arel_table[:return_date].gt(Transaction.arel_table[:expected_date])))
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."student_id" = 32 AND "transactions"."return_date" > "transactions"."expected_date"

  def returns
    @t = Transaction.find_by_id(params[:id])
    @t.update_attribute(:status, "returned")
     @t.update_attribute(:return_date, Date.today)
    #a = params[:id].to_i+1
    #Transaction.find(a).destroy
    @bk = Book.find_by_ISBN(params[:ISBN])
    copies = @bk[:copies]
    @bk.update_attribute(:copies, (copies.to_i+1).to_s)
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "transactions" SET "return_date" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["return_date", "2019-10-02 00:00:00"], ["updated_at", "2019-10-02 19:58:39.340617"], ["id", 29]]
SELECT  "books".* FROM "books" WHERE "books"."ISBN" = ? LIMIT ?  [["ISBN", "1"], ["LIMIT", 1]]
UPDATE "books" SET "copies" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["copies", "96"], ["updated_at", "2019-10-02 19:58:39.558561"], ["id", 12]]