app/views/librarians/_form.html.erb

  <div>
    <% @libraries = Library.all %>
---
SELECT "libraries".* FROM "libraries"